"""
求解《百钱百鸡》问题
1只公鸡5元 1只母鸡3元 3只小鸡1元 用100元买100只鸡
问公鸡 母鸡 小鸡各有多少只

Version: 0.1
Author: 骆昊
Date: 2018-03-02
"""

'''
5x + 3y + 1/3 * z = 100
  15x + 9y + z = 300
x + y + z = 100
  9x + 9y + 9z = 900
  15x + 15y + 15z = 1500
x,y,z 都是整数

6x = -600 + 8z
  x = -100 + 4/3 * z
6y = 1200 - 14z
  y = 200 - 7/3 * z
x > 0
y > 0
z > 0

-100 + 4/3 * z > 0
  -300 + 4z > 0
  z > 75
200 - 7/3 * z > 0
  600 - 7z > 0
  z < 85.7
z > 0

z = range(76,86)
'''

for x in range(0, 20):
    for y in range(0, 33):
        z = 100 - x - y
        if 5 * x + 3 * y + z / 3 == 100:
            print('公鸡: %d只, 母鸡: %d只, 小鸡: %d只' % (x, y, z))

# 要理解程序背后的算法 - 穷举法

print()
for z in range(101):
    for x in range(101):
        y = 100 - x - z
        if 15 * x + 9 * y + z == 300:
            print('公鸡: %d只, 母鸡: %d只, 小鸡: %d只' % (x, y, z))
